[
  {
    "company": "Corsair Gaming, Inc.",
    "icon": "https://i.imgur.com/Fe5gYOA.png",
    "title": "GTM Marketing Project Manager",
    "date": "March 2022 - October 2022",
    "description": "As a GTM Marketing Project Manager, I was in charge of product launch packaging schedules, photography briefs, and landing page briefs for the DIY business unit. For packaging, I helped drive project timelines end to end, working with internal, external, local, and international teams. For photography briefs, I submitted ideas and shotlists of what would work best for each specific product. I also wrote landing page briefs to provide the best user experience when navigating through product pages, including cross-selling compatible products. Day to day collaboration consisted of working with the creative teams, product managers, engineers, regulatory team, and OOBE team.",
    "res1": "-Managed packaging timelines for product launches, worked with creative teams, product managers, engineers, regulatory team, and OOBE team. Teams were local and international.",
    "res2": "-Wrote photography briefs for the DIY business unit. Submitted ideas and shotlists of what would work best for product.",
    "res3": "-Wrote landing page briefs to provide the best user experience when navigating through products page, including cross-selling compatible products.",
    "res4": "-Ensured all deliverables and requirements were met for the entirety of the product lifecycle. Assets included SKU sheets, 3D product renders, regionalization for packaging, photography, digital web assets, compliance logos, and tracking JIRA tickets."
  },
  {
    "company": "Albertsons Companies",
    "icon": "https://i.imgur.com/hsbZ2ec.png",
    "title": "Program Manager, Digital Marketing",
    "date": "September 2021 - March 2022",
    "description": "As a Digital Marketing Program Manager, I managed the planning of marketing channels used in Albertson's digital loyalty program. The virtual experience was a pilot program started to provide loyalty members a new experience during a time when going to the grocery store/events was inconvenient due to Covid-19. Another responsibility I had was working with external vendors to help run weekly food truck events in San Jose, CA and Tempe, AZ. All tasks required me to work with marketing channel leads developing timelines, email production, landing pages, special offers, and some video production. I also had the opportunity of writing push notification copy and designing my own in-app pop up's in Photoshop.",
    "res1": "-Managed the planning of marketing channels used in Albertson's digital loyalty campaigns. Planning involved working with marketing channel leads to develop work back times, generating emails, landing pages, offers, and video production.",
    "res2": "-Worked with an external vendor, the creative team, and marketing channel leads to manage weekly food truck events in San Jose, CA and Tempe, AZ.",
    "res3": "-Planned and executed the virtual loyalty experiences program, a pilot that provided loyalty members a new experience during a time when going to the grocery store/events was inconvenient due to Covid-19."
  },
  {
    "company": "Shutterfly, Inc.",
    "icon": "https://i.imgur.com/aiIia97.png",
    "title": "Email Marketing Associate Manager | Integrated Marketing Associate Manager | Partner Marketing Specialist",
    "date": "January 2018 - January 2021",
    "description": "I had the privilege of working in 3 different departments of marketing at Shutterfly, which better helped my understanding of marketing as an organization. As a Partner Marketing Specialist, I worked with all the Partner Marketing Managers to help set up offers, send out automated emails, tested promo codes, and reported data. The Integrated Marketing Associate Manager role allowed me to manage the integrated sales process from planning through launching of marketing campaigns. It also allowed me to work with the GM's, promotions team, creative team, and marketing channel leads to ensure that we drove the highest of revenue sales. Lastly, as an Email Marketing Associate Manager, I supported the CRM team by managing email campaigns from brief writing through deployment.",
    "res1": "-Supported the CRM team by managing over 30+ email campaigns during Shutterfly's peak seasons. Collaborated with multiple teams in different time zones from brief writing, kickoffs, creative production, web development, and operations, to email deployment.",
    "res2": "-Managed the integrated sales process from planning, creative brief writing, kicking off drivetime concepts, and establishing timelines for every project. Maintained the integrated marketing calendar keeping all channel leads and projects aligned.",
    "res3": "-Met with the GM's and Pricing & Promotions team on a weekly basis to discuss business-critical rush projects, contingency planning, and process of execution.",
    "res4": "-Worked with all the Partner Marketing Managers to help set up offers, send out automated emails, tested promo codes, and reported data."
  }
]
